name: "AlexNet for Office"

# -----------------------------------------------------------------------------
# ----------------------------------------------------------------- Data layer
# -----------------------------------------------------------------------------

# ---------------------------------------------------------------------- Source
# Train phase
layer {
  name: "source_train_0"
  type: "Data"
  top: "source_train_data_0"
  top: "source_train_label_0"
  data_param {
    source: "/home/ljh/caffe-master/examples/_imag_homo/_datasets/amazon_train_0_lmdb"
    backend: LMDB
    batch_size: 180
  }
  transform_param {
    crop_size: 227
    mean_file: "/home/ljh/caffe-master/data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
}

layer {
  name: "source_train_1"
  type: "Data"
  top: "source_train_data_1"
  top: "source_train_label_1"
  data_param {
    source: "/home/ljh/caffe-master/examples/_imag_homo/_datasets/dslr_train_0_lmdb"
    backend: LMDB
    batch_size: 40
  }
  transform_param {
    crop_size: 227
    mean_file: "/home/ljh/caffe-master/data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
}

# ---------------------------------------------------------------------- Target
# Test phase
layer {
  name: "target_test"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "/home/ljh/caffe-master/examples/_imag_homo/_datasets/webcam_train_0_lmdb"
    backend: LMDB
    batch_size: 60
  }
  transform_param {
    crop_size: 227
    mean_file: "/home/ljh/caffe-master/data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TEST }
}

# ---------------------------------------------------------- Data concatenation
# Train phase
layer {
  name: "concat_train_data"
  type: "Concat"
  bottom: "source_train_data_0"
  bottom: "source_train_data_1"
  top: "data"
  concat_param {
    concat_dim: 0
  }
  include: { phase: TRAIN }
}

layer {
  name: "concat_train_label"
  type: "Concat"
  bottom: "source_train_label_0"
  bottom: "source_train_label_1"
  top: "label"
  concat_param {
    concat_dim: 0
  }
  include: { phase: TRAIN }
}

# ----------------------------------------------------------------------------
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  top: "pool1_mask"
  pooling_param {
    pool: MAX
    kernel_c: 1
    kernel_h: 3
    kernel_w: 3
    stride_c: 1
    stride_h: 2
    stride_w: 2
  }
}
# ----------------------------------------------------------------------------
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  top: "pool2_mask"
  pooling_param {
    pool: MAX
    kernel_c: 1
    kernel_h: 3
    kernel_w: 3
    stride_c: 1
    stride_h: 2
    stride_w: 2
  }
}
# ----------------------------------------------------------------------------
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
# ----------------------------------------------------------------------------
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
# ----------------------------------------------------------------------------
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  top: "pool5_mask"
  pooling_param {
    pool: MAX
    kernel_c: 1
    kernel_h: 3
    kernel_w: 3
    stride_c: 1
    stride_h: 2
    stride_w: 2
  }
}
# ----------------------------------------------------------------------------
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
# ----------------------------------------------------------------------------
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
# ----------------------------------------------------------------------------
layer {
  name: "bottleneck"
  type: "InnerProduct"
  bottom: "fc7"
  top: "bottleneck"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

# ----------------------------------------------------------------------------
layer {
  name: "lp_fc8"
  type: "InnerProduct"
  bottom: "bottleneck"
  top: "lp_fc8"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 31
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "lp_fc8"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "lp_fc8"
  bottom: "label"
  top: "loss"
}

# ----------------------------------------------------------------------------decoder

layer {
  name: "de_bottleneck"
  type: "InnerProduct"
  bottom: "bottleneck"
  top: "de_fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layer {
  name: "de_drop7"
  type: "Dropout"
  bottom: "de_fc7"
  top: "de_fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "de_relu7"
  type: "ReLU"
  bottom: "de_fc7"
  top: "de_fc7"
}

layer {
  name: "de_fc7"
  type: "InnerProduct"
  bottom: "de_fc7"
  top: "de_fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layer {
  name: "de_drop6"
  type: "Dropout"
  bottom: "de_fc6"
  top: "de_fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "de_relu6"
  type: "ReLU"
  bottom: "de_fc6"
  top: "de_fc6"
}

layer {
  name: "de_fc6"
  type: "InnerProduct"
  bottom: "de_fc6"
  top: "de_pool5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 9216
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layer {
  name: "dereshape"
  type: "Reshape"
  bottom: "de_pool5"
  top: "de_pool5_reshaped"
  reshape_param {
    shape {
      dim: 0
      dim: 256
      dim: 6
      dim: -1
    }
  }
}

layer {
  name: "de_pool5"
  type: "Unpooling"
  bottom: "de_pool5_reshaped"
  bottom: "pool5_mask"
  top: "de_conv5"
  unpooling_param {
    unpool: MAX
    kernel_c: 1
    kernel_h: 3
    kernel_w: 3
    stride_c: 1
    stride_h: 2
    stride_w: 2
  }
}

layer {
  name: "de_relu5"
  type: "ReLU"
  bottom: "de_conv5"
  top: "de_conv5"
}

layer {
  name: "de_conv5"
  type: "Convolution"
  bottom: "de_conv5"
  top: "de_conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layer {
  name: "de_relu4"
  type: "ReLU"
  bottom: "de_conv4"
  top: "de_conv4"
}

layer {
  name: "de_conv4"
  type: "Convolution"
  bottom: "de_conv4"
  top: "de_conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layer {
  name: "de_relu3"
  type: "ReLU"
  bottom: "de_conv3"
  top: "de_conv3"
}

layer {
  name: "de_conv3"
  type: "Convolution"
  bottom: "de_conv3"
  top: "de_pool2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "de_pool2"
  type: "Unpooling"
  bottom: "de_pool2"
  bottom: "pool2_mask"
  top: "de_norm2"
  unpooling_param {
    unpool: MAX
    kernel_c: 1
    kernel_h: 3
    kernel_w: 3
    stride_c: 1
    stride_h: 2
    stride_w: 2
  }
}

layer {
  name: "de_norm2"
  type: "LRN"
  bottom: "de_norm2"
  top: "de_conv2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}

layer {
  name: "de_relu2"
  type: "ReLU"
  bottom: "de_conv2"
  top: "de_conv2"
}

layer {
  name: "de_conv2"
  type: "Convolution"
  bottom: "de_conv2"
  top: "de_pool1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layer {
  name: "de_pool1"
  type: "Unpooling"
  bottom: "de_pool1"
  bottom: "pool1_mask"
  top: "de_norm1"
  unpooling_param {
    unpool: MAX
    kernel_c: 1
    kernel_h: 3
    kernel_w: 3
    stride_c: 1
    stride_h: 2
    stride_w: 2
  }
}

layer {
  name: "de_norm1"
  type: "LRN"
  bottom: "de_norm1"
  top: "de_conv1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}

layer {
  name: "de_relu1"
  type: "ReLU"
  bottom: "de_conv1"
  top: "de_conv1"
}

layer {
  name: "de_conv1"
  type: "Deconvolution"
  bottom: "de_conv1"
  top: "de_data"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 3
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "eculidean_loss"
  type: "EuclideanLoss"
  bottom: "de_data"
  bottom: "data"
  top: "euc_loss"
  loss_weight: 0.1
}